''' Модуль для розрахунку результатів проби Руф’є.'''

txt_index = "Ваш індекс Руф’є: "
txt_workheart = "Працездатність серця: "
txt_nodata = '''немає даних для такого віку'''
txt_res = []
txt_res.append('''низька. Терміново зверніться до лікаря!''')
txt_res.append('''задовільна. Зверніться до лікаря!''')
txt_res.append('''середня. Можливо, варто додатково обстежитись у лікаря.''')
txt_res.append('''вище середнього''')
txt_res.append('''висока''')


def ruffier_index(P1, P2, P3):
   ''' повертає значення індексу за трьома показниками пульсу для звірки з таблицею'''
   return (4 * (P1+P2+P3) - 200) / 10


def neud_level(age):
   ''' варіанти з віком менше 7 і дорослим треба обробляти окремо,
    тут підбираємо рівень "незадовільно" тільки всередині таблиці:
    у віці 7 років "незад." - це індекс 21, далі кожні 2 роки він знижується на 1.5 до значення 15 в 15-16 років
 '''
   norm_age = (min(age, 15) - 7) // 2  # кожні 2 роки різниці від 7 років перетворюються на одиницю - аж до 15 років
   result = 21 - norm_age * 1.5 # множимо кожні 2 роки різниці на 1.5, так розподілені рівні у таблиці
   return result
  
def ruffier_result(r_index, level):
   ''' функція отримує індекс Руф’є і інтерпретує його,
    повертає рівень готовності: число від 0 до 4
    (що вище рівень готовності, то краще).
  '''
   if r_index >= level:
       return 0
   level = level - 4 # це не буде виконуватися, якщо ми вже повернули відповідь "незадовільно"
   if r_index >= level:
       return 1
   level = level - 5 # аналогічно, потрапляємо сюди, якщо рівень як мінімум "задов."
   if r_index >= level:
       return 2
   level = level - 5.5 # наступний рівень
   if r_index >= level:
       return 3
   return 4 # тут виявилися, якщо індекс менше від усіх проміжних рівнів, тобто. тестований крут.


def test(P1, P2, P3, age):
   ''' цю функцію можна використовувати зовні модуля для підрахунків індексу Руф’є.
    Повертає готові тексти, які залишається намалювати у потрібному місці
    Використовує для текстів константи, задані на початку цього модуля.
 '''
   if age < 7:
       return (txt_index + "0", txt_nodata) # таємниця ця не для цього тесту
   else:
       ruff_index = ruffier_index(P1, P2, P3) # розрахунок
       result = txt_res[ruffier_result(ruff_index, neud_level(age))] # інтерпретація, переведення числового рівня підготовки до текстових даних
       res = txt_index + str(ruff_index) + '\n' + txt_workheart + result
       return res
